//
//  ZawgyiSegmentationHelper.m
//  Pods
//
//  Created by Khant Thu Linn on 13/6/16.
//
//

#import "ZawgyiSegmentationHelper.h"

#pragma mark - Preparation 

#define MYANMAR_CONSONANTS @[ @"က", @"ခ", @"ဂ", @"ဃ", @"င", @"စ", @"ဆ", @"ဇ", @"စ်", @"ည", @"ဋ", @"ဌ", @"ဍ", @"ဎ", @"ဏ", @"တ", @"ထ", @"ဒ", @"ဓ", @"န", @"ပ", @"ဖ", @"ဗ", @"ဘ", @"မ", @"ယ", @"ရ", @"လ", @"၀", @"သ", @"ဟ", @"႒", @"အ"]

#define MYANMAR_NOUN @[@"ဘုရား", @"တရား", @"သံဃာ", @"မိဘ", @"ဆရာ"] //later populate more

#define MYANMAR_PRONOUN @[@"ကၽြန္ေတာ္", @"ကၽြန္မ", @"က်ဳပ္", @"ရွင္", @"နင္", @"ငါ", @"မင္း", @"သူ", @"တို႔", @"သင္း", @"ဒီ", @"ရွင့္", @"နင့္", @"ငါ့", @"ေကာင္", @"ဘာ့သာ", @"ကိုယ္", @"ကိုယ့္", @"သူ႕"]

#define MYANMAR_ENDINGWORD @[@"သည္", @"မည္", @"တယ္", @"ပာ", @"ေပ႔", @"လဲ", @"မွာ", @"မ", @"လား", @"လို႔", @"လိုက္", @"ဖို႔", @"ကို", @"က", @"႒္", @"ဆီ", @"ထံ", @"သို႔", @"ရ", @"မယ္", @"ၾက", @"ေအာင္", @"ရယ္", @"အံုး", @"ေနာ္", @"ေန", @"တာ", @"ေတာ့", @"တဲ့", @"ေလ", @"ၿပီ", @"ဟာ", @"သာ", @"ကြာ", @"ျပစ္", @"ထား", @"ေပး", @"နဲ႔", @"ဘူး", @"ခ်င္", @"မိ", @"ပာ", @"ဆို", @"တဲ့", @"ေယာင္", @"တိုင္း", @"အတြက္", @"ေၾကာင့္", @"ၿပီး", @"သြား", @"ဘယ္", @"ဘာ", @"ကဲ့", @"ရဲ႕", @"ခ", @"နဲ", @"ငွာ", @"စပ္", @"မႈ", @"စြ", @"စြာ", @"ဆန္း", @"တကာ", @"တကား", @"တႏႈန္း", @"တပာ", @"တည္း", @"တမံု႔", @"တမွ်", @"တျမႇင့္", @"တရ", @"တရွိ", @"တရွည့္", @"တူတူ", @"တဲ့", @"ေတာင္", @"တိုင္", @"တန္မဲ့", @"တန္ရာ", @"တုန္း", @"တံု", @"တံုး", @"တြဲ", @"တြင္", @"ထူး", @"ထဲ", @"ထဲက", @"ထဲမွ", @"ထံပါး", @"ထံမွ", @"ထံေမွာက္", @"ထို", @"ထိုနည္းတူ", @"ထိုနည္းအတူ", @"ထိုမွတစ္ပါး", @"ထိုမွ်ေလာက္", @"ထိုအခါ", @"ထို႔ေၾကာင့္", @"ထို႔ေနာက္", @"ထို႔ျပင္", @"ထို႔အျပင္", @"ႏွယ္", @"ထို႔အတူ", @"ထက္တိုင္", @"ထက္ထိ", @"ထိုက္", @"ထပ္", @"ထုပ္", @"ထြာ", @"ေထြ", @"ဒါ", @"ဒာထက္", @"ဒါနဲ႔", @"ဒါေပမဲ့", @"ဒါပဲ", @"ဒါေပာ့", @"ဒါျဖင့္", @"ဒါျဖင့္ရင္", @"နီးနီး", @"နီးပါး", @"ေနက်", @"ေနေနသာသာ", @"ေနာ", @"ႏို႔", @"၍", @"ဤ", @"၏", @"ႏိုင္", @"ႏိုင္စြမ္း", @"နည္း", @"နည္းတူ", @"နပ္", @"ႏွင့္", @"ႏွင့္ညီစြာ", @"ႏွင့္တကြ", @"ႏွင့္အတူ", @"ႏွင့္အမွ်"]

#define STARTING_WORD @[ @"က", @"ခ", @"ဂ", @"ဃ", @"င", @"စ", @"ဆ", @"ဇ", @"စ်", @"ည", @"ဋ", @"ဌ", @"ဍ", @"ဎ", @"ဏ", @"တ", @"ထ", @"ဒ", @"ဓ", @"န", @"ပ", @"ဖ", @"ဗ", @"ဘ", @"မ", @"ယ", @"ရ", @"လ", @"၀", @"ဝ", @"သ", @"ဟ", @"႒", @"အ", @"ေ", @"ႀ", @"ၿ", @"ၾ", @"ျ", @"ႂ", @"ႁ", @"ႄ", @"ႃ", @"ဥ", @" @", @"ႏ", @"၍", @"ဤ", @"၏", @"႐", @"ၫ", @"ႆ", @"ၪ", @"ဉ", @"၌", @"ဧ", @"႗", @"ၮ", @"ၯ", @"႑", @"၎", @"ဣ", @"ဩ", @"ဪ", @"ဦ", @"။", @"၊", @"“", @"”", @"[", @"]", @",", @".", @"+", @"-", @" X @", @"/", @"=", @"%", @"၁", @"၂", @"၃", @"၄", @"၅", @"၆", @"၇", @"၈", @"၉", @"၀" ]

#define MYANMAR_COMBINED_WORD @[ @"ဘုရား", @"တရား", @"သံဃာ", @"မိဘ", @"ဆရာ", @"က်ြန္ေတာ္", @"က်ြန္မ", @"ယမင္း", @"ဥမၼာ", @"ဘာ့သာ", @"အတြက္", @"အခာ", @"ခမ်ာ", @"ကဆုန္ေပာက္", @"ကျမင္း", @"ကလိ", @"ကလိမ္ကညစ္", @"ကလိမ္က်", @"ကဲ့ရဲ့", @"ကန့္သတ္", @"ျကံစည္", @"ျကင္နာ", @"ျကည္ညို", @"ျကန့္ျကာ", @"ျကမ္းျကုတ္", @"ကလိမ္ကက်စ္", @"ခြင့္ေတာင္း", @"ခြင့္ပန္", @"ခြင့္ဆို", @"ခနဲ့", @"ခက္ထန္", @"ခ်ီးက်ူး", @"ခ်ီးမြမ္း", @"ခ်ီးေျမွာက္", @"ေခ်ာ္ေတာေငာ့", @"ေခ်ာက္က်", @"ေခ်ာက္ခ်", @"ေခ်ာက္တြန္း", @"ေခ်ာလဲေရာထိုင္", @"ေခ်ာင္းဆိုး", @"ေခ်ာင္းဟန့္", @"ခ်ိန္သားကိုက္", @"ခ်မ္းသာ", @"ျခိုးျခံ", @"ေခ်ာင္းေျမာင္း", @"ခြင့္လြွတ္", @"စာနာ", @"စာက်က္", @"တည္းျဖတ္", @"နာျကည္း", @"ေနွာင့္ယွက္", @"ပင္ပန္း", @"ပသ", @"ရွိခိုး", @"ရွင္သန္", @"ဟန္ေဆာင္" ]

#pragma mark - Word Combination and Search

#define TWO_WORDS @[ @"ျကန့္ျကာ", @"ဘုရား", @"တရား", @"သံဃာ", @"မိဘ", @"ဆရာ", @"မဂၤလာ", @"ကုလား", @"က်ြန္ေတာ္", @"က်ြန္မ", @"ဘာ့သာ", @"ယမင္း", @"အတြက္", @"အခာ", @"ခမ်ာ", @"ကျမင္း", @"ကလိ", @"ကလိမ္က်", @"ခနဲ့", @"ေခ်ာက္က်", @"ေခ်ာက္ခ်", @"ေခ်ာက္တြန္း", @"တည္းျဖတ္", @"ရွိခိုး", @"ကန့္လန့္", @"ကုန္ကုန္", @"ကလိန္", @"ျကံ့ခိုင္", @"ျကိုတင္", @"ျကည္လင္", @"က်ဥ္းက်ုတ္", @"က်ဥ္းေျမာင္း", @"က်ြက္က်ြက္", @"ခ်ဲ့ခ်ဲ့", @"ခ်ို့ယြင္း", @"ခိုင္မာ", @"ခ်ို့တဲ့", @"ခ်ို့ငဲ့", @"ခက္ခဲ", @"ခမ္းနား", @"ေခ်ာေမာ", @"ေခ်ာေမြ့", @"ခ်က္ခ်င္း", @"ငယ္ရြယ္", @"ေငြ့ေငြ့", @"ေစြ့ေစြ့", @"ေစြးေစြး", @"စစ္စစ္", @"စိတ္ျကိုက္", @"ေစာေစာ", @"ဆြဆြ", @"ဆိုးသြမ္း", @"ဆက္တိုက္", @"ဆက္လက္", @"ဆတ္ဆတ္", @"ဆက္ဆက္", @"ေဆာလ်င္", @"ဆိုးရြား", @"ဆိုးဝား", @"မေရြး", @"မရ", @"ဇက္ကုန္", @"ေဇာက္ခ်", @"တမင္", @"ေတာ္ေတာ္", @"တင္းလင္း", @"တန္းလန္း", @"တင္းရင္း", @"ေတာ္တည့္", @"တက္သုတ္", @"တက္သုတ္", @"တင္းတင္း", @"တင္းမာ", @"တစ္ပား", @"တြတ္တြတ္", @"တေစ", @"တေစာင္း", @"တကြ", @"တျခား", @"တံ့တံ့", @"တံုးတိ", @"တမာ", @"တလြဲ", @"တဝ", @"တိုးလွ်ိူ", @"တိုေတာင္း", @"တစ္ခာ", @"တစ္ဆင့္", @"တစ္နိုင္", @"တတ္တိုင္း", @"တံုးေတ", @"ေတြေတြ", @"တူးတည္", @"တကယ္", @"တကယ့္", @"တိုထြာ", @"ေတာက္ေျပာင္", @"တပ္အပ္", @"တပ္ျကပ္", @"တစ္အား", @"တံုးလံုး", @"တြဲလဲ", @"တြဲေလာင္း", @"တြဲလ်ား", @"ထူးျခား", @"ထက္ျမက္", @"ထီးတည္း", @"ထူးေထြ", @"ေထာ့က်ိုး", @"ေထာ့နဲ့", @"ေထာ့နင္း", @"ထက္ခ်ည္း", @"ထက္ခ်မ္း", @"ထက္ပိုင္း", @"ေထာင့္တန္း", @"ထစ္ထစ္", @"ထပ္ဆင့္", @"ထပ္ကြမ္း", @"ထပ္တူ", @"ထပ္မံ", @"ထပ္ေလာင္း", @"ထိပ္တိုက္", @"ထြားက်ိုင္း", @"ေထြလာ", @"ထြက္ျမတ္", @"တကာ", @"တကား", @"တနႈန္း", @"တပာ", @"တမံု့", @"တမွ်", @"တျမွင့္", @"တရ", @"တရွိ", @"တရွည့္", @"တူတူ", @"တန္မဲ့", @"တန္ရာ", @"ထဲက", @"ထဲမွ", @"ထံပား", @"ထံမွ", @"ထံေမွာက္", @"ထို့ေျကာင့္", @"ထို့ေနာက္", @"ထို့ျပင္", @"ထက္တိုင္", @"ထက္ထိ", @"ဒာထက္", @"ဒာနဲ့", @"ဒာပဲ", @"ဒာေပာ့", @"ဒာျဖင့္", @"နီးနီး", @"နီးပား", @"ေနက်", @"နိုင္စြမ္း", @"နည္းတူ", @"ေခ်ာင္းဆိုး", @"ေခ်ာင္းဟန့္", @"ခ်မ္းသာ", @"ခ်ီးေျမွာက္", @"ခ်ီးမြမ္း", @"ခ်ီးက်ူး", @"ခက္ထန္", @"ခြင့္လြွတ္", @"ခြင့္ေတာင္း", @"ခြင့္ပန္", @"ခြင့္ဆို", @"စာနာ", @"စာက်က္", @"ငိုက္မ်ဥ္း", @"ေတာ္လည္း", @"ေတာ္လွန္", @"ေတာ္ဝင္", @"တက္လွမ္း", @"ေတာက္ေခာက္", @"တိုးျကိတ္", @"တိုးခ်ဲ့", @"တိုးတက္", @"တိုးပြား", @"တိုးျမွင့္", @"တိုးလွ်ိူး", @"တိုက္ေကွြး", @"တက္ျကြ", @"တက္ေရာက္", @"တိုက္ခိုက္", @"တိုက္စား", @"တိုက္ဆိုင္", @"တိုက္တြန္း", @"တိုက္ဖ်က္", @"တင္ျကို", @"တင္ကူး", @"တင္စား", @"တင္စီး", @"တင္ဆက္", @"တင္ေဆာင္", @"တင္ေတာင္း", @"တင္ျပ", @"တိုက္ပိတ္", @"တင္ပို့", @"တင္ေျမွာက္", @"တင္ေလွ်ာက္", @"တင္သြင္း", @"တင္းျကပ္", @"တင္းတိမ္", @"ေတာင္းဆို", @"ေတာင္းပန္", @"တိုင္ျကား", @"တိုင္ေတာ", @"တိုင္တည္", @"တိုင္တန္း", @"တိုင္ပင္", @"တည္ျကည္", @"တည္ခင္း", @"တည္ျငိမ္", @"တည္ေဆာက္", @"တည္တံ့", @"တည္ေထာင္", @"တည္ျမဲ", @"တည္ရာ", @"တည္ရွိ", @"တည့္မတ္", @"တတ္ကွြမ္း", @"တတ္စြမ္း", @"တတ္နိုင္", @"တတ္ပြန္", @"တတ္ေျမာက္", @"တန္ျပန္", @"တန္းစီ", @"တန္းညွိ", @"တန္းျဖုတ္", @"တုန္ခာ", @"တုန္ခ်ည့္", @"တပ္ျငိ", @"တပ္စြန္း", @"တပ္ဆင္", @"တပ္ေျပြ့", @"တပ္မက္", @"တပ္ျမို့", @"တပ္ေခာက္", @"တပ္ခင္း", @"တပ္နုတ္", @"တပ္ပ်က္", @"တပ္ေဖ်ာက္", @"တပ္ျဖန့္", @"တပ္လန္", @"တပ္လွန့္", @"တုပ္ကြ", @"တုပ္ေနွာင္", @"တုပ္ပ်ပ္", @"တုပ္ဝပ္", @"တမ္းေစ့", @"တမ္းတ", @"တိမ္ေကာ", @"တိမ္ငုပ္", @"တိမ္ျမုပ္", @"တိမ္က်", @"တိမ္ခြပ္", @"တိမ္ေတာက္", @"တိမ္းေစာင္း", @"တိမ္းညြတ္", @"တိမ္းပား", @"တိမ္းမပ္", @"တိမ္းေမွာက္", @"တိမ္းယိမ္း", @"တိမ္းေရွာင္", @"တံု့ကန္", @"တံု့ဆိုင္း", @"တံု့ျပန္", @"တံုးေက်ာ္", @"တံုးေခာက္", @"ေတြေဝ", @"ေတြ့ျကံု", @"ေတြ့ဆံု", @"ေတြ့ထိ", @"ေတြ့ျမင္", @"ေတြးေခၚ", @"ေတြးဆ", @"ေတြးေတာ", @"ေတြးထင္", @"ေတြးေျမာ္", @"ေတြးရွူ", @"တြဲခုတ္", @"တြဲခ်ိတ္", @"တြဲစပ္", @"တြဲထိုး", @"တြဲဖက္", @"တြက္ကတ္", @"တြက္ခ်က္", @"တြက္ခ်င့္", @"တြယ္တာ", @"တြက္စစ္", @"တြက္ဆ", @"တြင္ခုပ္", @"တြင္စုပ္", @"တြင္ခံ", @"တြင္ခုတ္", @"တြင္းစိမ္", @"တြင္းေအာင္း", @"တြတ္ထိုး", @"တြန္က်ူး", @"တြန့္ဆုတ္", @"တြန့္တို", @"တြန့္ရွံူ့", @"တြန့္လိမ္", @"တြန့္လိပ္", @"တြန္းကန္", @"တြန္းထိုး", @"တြန္းလွန္" ]

#define THREE_WORDS  @[ @"ျကံ့ျကံ့ခံ", @"ကျမင္းေျကာ", @"ကေပာက္တိ", @"ကေပာက္ခ်ာ", @"ခ်က္ခနဲ", @"ခ်စ္စနိုး", @"ခ်ာခနဲ", @"ခ်စ္ခ်စ္ေတာက္", @"ခ်ာခ်ာလည္", @"ခ်မ္းစိမ့္စိမ့္", @"ခ်ာတူးလန္", @"ခပ္တန္းတန္း", @"ေခ်ာက်ိက်ိ", @"ခ်က္တစ္ျဖုတ္", @"ခ်ိူျမျမ", @"ခ်င့္စဖြယ္", @"ခံုတမင္", @"ခ်င္စဖြယ္", @"ခေနာ္နီ", @"ခေနာ္နဲ့", @"ငမ္းငမ္းတက္", @"စီရရီ", @"စိတ္ရွိတိုင္း", @"ေစြ့ခနဲ", @"စိမ္းဆတ္ဆတ္", @"စုတ္ခွြန္းခွြန္း", @"စိမ္းဖပ္ဖပ္", @"စင္းလံုးေခ်ာ", @"စိမ္းဖန့္ဖန့္", @"စိမ္းေရြွေရြွ", @"ဆတ္ခနဲ", @"ေဆာတလ်င္", @"ဆိုးခနဲ", @"ေဆာက္တည္ရာ", @"ဗံုမဆင့္", @"ဆိုင္းမဆင့္", @"ဇိုးခနဲ", @"ဇတ္ခနဲ", @"ဇြတ္တရြတ္", @"ညွဥ္းဆိုးဆိုး", @"ညွဥ္းသိုးသိုး", @"ညလံုးေပာက္", @"ေညာင္ညည့္ညည့္", @"ေညာင္နာနာ", @"တရေဟာ", @"တရရ", @"တရားေသ", @"တက္သစ္စ", @"တရိရိ", @"တစ္ျပိုင္နက္", @"တရုန္းရုန္း", @"တစ္ျပန္စီး", @"တရိပ္ရိပ္", @"တစ္ျပံုျကီး", @"တလန္းျကား", @"တျဖုတ္ျဖုတ္", @"တသုန္သုန္", @"တမ်ားမ်ား", @"တသြင္သြင္", @"တျမျမ", @"တာေတလံ", @"တရျကမ္း", @"တရနွံ့", @"တရစပ္", @"တဟုန္းဟုန္း", @"တရတြန္း", @"တအိအိ", @"တစ္ပာတည္း", @"တစ္ပင္တိုင္", @"တစူးစား", @"တစ္ပတ္နြမ္း", @"တေထာင္းေထာင္း", @"တစ္ပတ္ရစ္", @"တထစ္ခ်", @"တေလွာင္းေလွာင္း", @"တစ္ဟုန္ထိုး", @"တစ္ကိုယ္ေကာင္း", @"တစ္ဖက္သတ္", @"တစ္က်ံ့တည္း", @"တစ္ျဖတ္တည္း", @"တစ္ခ်က္တည္း", @"တခိခိ", @"တစ္ခ်က္လြွတ္", @"တခစ္ခစ္", @"တနံု့နံု့", @"တေငြ့ေငြ့", @"တဖြဖြ", @"တစီစီ", @"တျဖူးျဖူး", @"တံုးတိတိ", @"တအီအီ", @"တစ္ခာက", @"တက်က္က်က္", @"တတြတ္တြတ္", @"တက်ည္က်ည္", @"တျဖည္းျဖည္း", @"တစာစာ", @"တဖ်ဥ္းဖ်ဥ္း", @"တသြတ္သြတ္", @"တေရွာင္ေရွာင္", @"တိုနံ့နံ့", @"တလွပ္လွပ္", @"တက္တက္စင္", @"တသက္သက္", @"တစ္ခာတည္း", @"တစ္ေနကုန္", @"တစ္ဇြတ္ထိုး", @"တစ္ေျပးညီ", @"တကဲကဲ", @"တစ္ေျပးတည္း", @"တေကာက္ေကာက္", @"တစ္ရွူးထိုး", @"တစိမ့္စိမ့္", @"တစ္ရွိန္ထိုး", @"တစြတ္စြတ္", @"တစ္သားတည္း", @"တိတ္တခိုး", @"တစ္ဆက္တည္း", @"တိတ္တဆိတ္", @"တစ္ထပ္တည္း", @"တစ္ဘီးလွိမ့္", @"တိတ္တိတ္ပုန္း", @"တစ္သီျကီး", @"တစ္ေလာက", @"ထပ္မံ", @"ထပ္ေလာင္း", @"ထိပ္တိုက္", @"ထြားက်ိုင္း", @"ေထြလာ", @"ထြက္ျမတ္", @"ထာဝစဥ္", @"ထီးထီးျကီး", @"ထစ္ခနဲ", @"ထိတ္ထိတ္ျကဲ", @"ထုတ္ခ်င္းေပာက္", @"ထပ္မနား", @"ထံုေတေတ", @"ထံုေပေပ", @"ထိုနည္းတူ", @"ထိုမွ်ေလာက္", @"ထိုအခာ", @"ထို့အျပင္", @"ထို့အတူ", @"ဒာေပမဲ့", @"ဒာျဖင့္ရင္", @"နွင့္ညီစြာ", @"နွင့္တကြ", @"နွင့္အတူ", @"နွင့္အမွ်", @"ခ်ိန္သားကိုက္", @"ေခ်ာ္ေတာေငာ့", @"တစ္စင္ေထာင္", @"တစ္ပတ္ရိုက္", @"တစ္ပတ္လွိမ့္", @"တစ္ပန္းရႈံး", @"တစ္ပန္းသာ", @"တစ္ေရးနိုး", @"တတ္သိလိမၼာ", @"တန္ကာက်", @"ေတာ္ကာက်", @"တန္ဖိုးျဖတ္", @"တပ္နွစ္သက္", @"တံုးတံုးခ်", @"တြက္ေျခကိုက္", @"တြက္သားကိုက္", @"တြန္းအားေပး", @"တက္သိလိမၼာ" ]

#define FOUR_WORDS @[ @"ကစိုကရြား", @"ကတုန္းကတိုက္", @"ကစဥ္ကလ်ား", @"ကပက္ကစက္", @"ကစိန္းကဝား", @"ကေပာက္ကေရာက္", @"ကတုန္ကယင္", @"က်ူက်ူပာေအာင္", @"ကပိုကရို", @"ကျပက္ကေခ်ာ္", @"ကနြဲ့ကလ်", @"ကိုယ္ထူးကိုယ္ခ်ြန္", @"ကပ်ာကယာ", @"ကေမာက္ကမ", @"ကပ်စ္ကညစ္", @"ကေရာေသာပား", @"ကမကထ", @"ကေရာကမယ္", @"ကမန္းကတန္း", @"ကေလကလြင့္", @"ကရိကထ", @"ကလန္ကလား", @"ကလီကမာ", @"ကလိန္းကလက္", @"ကူလီကူမာ", @"ကေသာကေမ်ာ", @"ကလန္ကဆန္", @"ကတ္တီးကတ္ဖဲ့", @"ကသီကရီ", @"ကန့္လန့္ကန့္လန့္", @"ကသီလင္တ", @"က်ိုးတိုးက်ဲတဲ", @"ကမူးရွူးထိုး", @"ကတုန္ကရင္", @"ကပ်ာကသီ", @"ျကံျကီးစည္ရာ", @"ကေတာကေမ်ာ", @"ျကိုးျကားျကိုးျကား", @"ကေတာက္ကဆတ္", @"ကေတာက္ကဆတ္", @"ကေတာက္ကတက္", @"ျကက္ေပ်ာက္ငွက္ေပ်ာက္", @"ကေလးကလား", @"ကတိုက္ကရိုက္", @"ကေျပာင္းကျပန္", @"ကလိန္ကက်စ္", @"ကယုကယ", @"ကေယာင္ေခ်ာက္ခ်ား", @"ကေယာက္ကယက္", @"ကတမ္းကရမ္း", @"ကေယာင္ကတမ္း", @"ကေမ်ာေသာပား", @"ေျကာက္ေျကာက္ရြံ့ရြံ့", @"ကုတ္ကုတ္ကတ္ကတ္", @"ကလယ္ကလယ္", @"ကတ္ကတ္သတ္သတ္", @"ကသိကေအာက္", @"ကတ္သီးကတ္သတ္", @"ကိုးရိုးကားယား", @"ကိုယ္ထိလက္ေရာက္", @"ကိုးလိုးကန့္လန့္", @"က်ီးကန္းေတာင္ေမွာက္", @"ျကိုးစားပမ္းစား", @"ေက်ေက်လည္လည္", @"ျကက္အိပ္ျကက္နိုး", @"ျကိုးျကိုးကုတ္ကုတ္", @"ခိုးလိုးခုလု", @"ခ်က္ေစ့လက္ေစ့", @"ခမ္းျကီးနားျကီး", @"ခေနာ္ခနဲ့", @"ခမ္းခမ္းနားနား", @"ခ်ာလပတ္လည္", @"ခ်ိူးခ်ိူးဖဲ့ဖဲ့", @"ေခ်ာေခ်ာေမာေမာ", @"ခ်က္က်လက္က်", @"ေခ်ာက္ခ်ီးေခ်ာက္ခ်က္", @"ခ်က္ခ်င္းလက္ငင္း", @"ေခ်ာက္တီးေခ်ာက္ကပ္", @"ခ်မ္းခ်မ္းသာသာ", @"ဂနာမျငိမ္", @"ငိုးတိုးေငာက္ေတာက္", @"ငယ္စဥ္ျကီးလိုက္", @"ျငိုးျငိုးျငိမ့္ျငိမ့္", @"ငြားငြားစြင့္စြင့္", @"စန့္စန့္ရန့္ရန့္", @"စြပ္စြပ္ရြပ္ရြပ္", @"စိတ္ေအးလက္ေအး", @"စိတ္လိုလက္ရ", @"ေစာေစာစီးစီး", @"စိတ္ခ်လက္ခ်", @"စစ္စစ္ေပာက္ေပာက္", @"စိတ္ေနာက္ကိုယ္ပာ", @"စဥ္းစဥ္းစားစား", @"စြမ္းစြမ္းတမံ", @"ေစာ္ကားေမာ္ကား", @"စိတ္ေထာင္းကိုယ္ေျက", @"ေစာင္းပားရိပ္ခ်ည္", @"စိတ္ပာလက္ပာ", @"စည္းမဲ့ကမ္းမဲ့", @"စြတ္ကယ္စြတ္ကယ္", @"စည္းလြတ္ဝားလြတ္", @"စြတ္စြတ္ရြတ္ရြတ္", @"စိတ္တူကိုယ္မွ်", @"ဆူးဆူးရားရား", @"ဆင္းေတာင့္ဆင္းရဲ", @"ဆူျကံုနိမ့္ျမင့္", @"ေဆာင့္ျကီးေအာင့္ျကီး", @"ဆတ္ေကာ့လတ္ေကာ့", @"ဆင္းဆင္းရဲရဲ", @"ဆတ္တငံ့ငံ့", @"ဆြဲဆြဲငင္ငင္", @"ဆိုးဆိုးဆတ္ဆတ္", @"ဆယ္ခာတစ္ခာ", @"ေဆးေဖာေျကာဖက္", @"ဆန့္ငင္ဆန့္ငင္", @"ဇက္ရဲလက္ရဲ", @"ဇိုးဇိုးဇတ္ဇတ္", @"ဇြတ္တိဇြတ္ထိုး", @"ေဇာက္တိေဇာက္ထိုး", @"ေဇာက္ထိုးမိုးေမွ်ာ္", @"ညီညီညာညာ", @"ညိုးညိုးညံညံ", @"ညီညာျဖျဖ", @"ညိုးညိုးညိတ္ညိတ္", @"ညီတူညာတူ", @"ညစ္တီးညစ္ပတ္", @"ညစ္ညစ္ပတ္ပတ္", @"တစ္ျမံုတစ္မ", @"တဖ်င့္တပား", @"တိတိပပ", @"တစီတလ်ဥ္", @"တေစ့တေစာင္း", @"တစီးတေစာင္း", @"တပိတပိုင္း", @"တဝဲလည္လည္", @"တပိုတပား", @"တိတိရိရိ", @"တလံုလဲလဲ", @"တိတိလင္းလင္း", @"ေတာ္ရံုတန္ရံု", @"တံခားမရွိ", @"ေတာ္ရိေလ်ာ္ရိ", @"တီတီတာတာ", @"တသီတသန္း", @"တိုစိတိုစိ", @"တိုးလိုးတန္းလန္း", @"တစ္စတစ္စ", @"တိုးလိုးတြဲေလာင္း", @"တစ္ဖက္စီးနင္း", @"တစ္လက္စတည္း", @"တစ္လံုးတစ္ခဲ", @"တစ္ဝက္တစ္ပ်က္", @"တတန္တက", @"တစ္သမတ္တည္း", @"တေထဝတည္း", @"ေတာ္စြေလ်ာ္စြ", @"တအံုေနြးေနြး", @"တိုေရရွားေရ", @"တစ္ခာတေလ", @"တစ္တိတစ္တိ", @"တစ္ခာတစ္ရံ", @"တကူးတက", @"တေတာက္ပတ္ပတ္", @"တကူးတကန့္", @"တေထရာတည္း", @"ေတာ္ေတာ္တန္တန္", @"တဖ်စ္ေတာက္ေတာက္", @"တိုးတိုးက်ိတ္က်ိတ္", @"တရားလက္လြတ္", @"တိုးတိုးတိတ္တိတ္", @"တရြတ္တသီ", @"တက္ကုန္လက္ကုန္", @"တလိမ့္ေခာက္ေကြး", @"တက္ညီလက္ညီ", @"တိုတိုေတာင္းေတာင္း", @"တင္းျပည့္က်ပ္ျပည့္", @"တိုတိုတုတ္တုတ္", @"တင့္ေတာင့္တင့္တယ္", @"တိုးတိုးသက္သာ", @"တင္းတင္းရင္းရင္း", @"တူတူတန္တန္", @"တစ္ေန့တျခား", @"ေတာ့တီးေတာ့တ", @"တစ္ပံုစံတည္း", @"ေတာ္ကာေလ်ာ္ကာ", @"တစ္ဖက္ေစာင္းနင္း", @"တစ္နိုင္တစ္ပိုင္", @"တစ္ရံတစ္ဆစ္", @"တစ္ျမံုတစ္သိုက္", @"တံု့ေနွးတံု့ေနွး", @"တစ္ေန့တစ္ျခား", @"တံု့ပယ္တံု့ပယ္", @"တစ္မုဟုတ္ခ်င္း", @"တန္းတူရည္တူ", @"တန္းတန္းမတ္မတ္", @"တံုးလံုးပက္လက္", @"တစ္ဖက္တစ္လမ္း", @"တုန္တုန္ယင္ယင္", @"တည္တည္ပပ", @"တုန္တုန္ရီရီ", @"တြန္းတြန္းထိုးထိုး", @"တပ္အပ္ေသခ်ာ", @"တစ္ေယာက္တစ္ေပာက္", @"တစ္ေအာင့္တစ္နား", @"တစ္ေယာက္တစ္ျပန္", @"တည္တည္ျကည္ျကည္", @"တစ္ေယာက္တစ္လဲ", @"တစ္ေယာက္တစ္လွည့္", @"ထီးထီးမားမား", @"ေထာ္ေလာ္ကန့္လန့္", @"ထိုးထိုးေထာင္ေထာင္", @"ထက္ျကပ္မကြာ", @"ထိုက္ထိုက္တန္တန္", @"ထင္ေယာင္ထင္မွား", @"ထင္ရာျမင္ရာ", @"ေထာင္ေထာင္ေမာင္းေမာင္း", @"ေထာင္ေထာင္ေမာင္းေမာင္း", @"ေထာင္ပံုရာပံု", @"ထည္ထည္ဝာဝာ", @"ထပ္ကာထပ္ကာ", @"ထပ္တူထပ္မွ်", @"ထံု့ပိုင္းထံု့ပိုင္း", @"ထပ္တလဲလဲ", @"ထံုးမီစံမွ်", @"ေထြေထြထူးထူး", @"ေထြေထြရာရာ", @"ေထြေထြလည္လည္", @"ေထြးလားလံုးလား", @"ေထြလီကာလီ", @"ေထြးေရာယွက္တင္", @"ေထြးလံုးရစ္ပတ္", @"ထြန္းထြန္းေပာက္ေပာက္", @"ထိုနည္းအတူ", @"ထိုမွတစ္ပား", @"ေနေနသာသာ", @"ကလိမ္ကက်စ္", @"ေခ်ာလဲေရာထိုင္" ]

#pragma mark - Myanmar Verb

#define MYANMAR_VERB_A @[ @"ႀကိဳက္", @"ကယ္", @"ကူညီ", @"ကူး", @"ကူ", @"ၾကည့္", @"ကုန္း", "ႂကြ", @"ကိုက္", @"ႀကိတ္", @"ေၾကာ္", @"က်", @"က်ိဳ", @"ကား", @"က်န္", @"ၾကပ္", @"ကြဲ", @"ၾကား", @"ေကြး", @"ေကာက္", @"က်ီ", @"ကင္", @"ေႂကြ", @"ကြ", @"ကြိ", @"ကၽြတ္", @"ကဆုန္ေပါက္", @"ကျမင္း", @"ကလိ", @"ကလိမ္ကညစ္", @"ကလိမ္က်", @"ကဲ့ရဲ့", @"ေကာ့", @"ကုန္", "ႂကြင္း", @"ကင္း", @"ကန္", @"ကန္႔သတ္", @"က်ဴ", @"ၾကဴ", @"ေက်ာ္", @"က်ဴး", @"ေက်", @"က်ိဳး", @"က်စ္", @"က်ိန္း", @"က်ပ္", @"ၾကံ", @"ၾကံစည္", @"ၾကင္နာ", @"ၾကည္ညိႇ", @"ၾကန္႔ၾကာ", @"ၾကမ္းၾကဳတ္", @"ႀကံဳ", @"ႀကံဳး", @"ကြာ", @"ေကြ႕", @"ကဲ", @"ကြပ္", @"ေကၽြး", "ႂကြား", @"ကလိန္ကက်စ္", @"ကြယ္", @"ကပ္", @"ေၾက", @"ကိုင္", @"ကုပ္" ]

#define MYANMAR_VERB_B { @"ခ်စ္", @"ေခၚ", @"ခိုက္", @"ခ်က္", @"ခၽြတ္", @"ခ်", @"ခ်ဲ႕", @"ခ်ဳပ္", @"ခ်ံဳ႕", @"ခၽြန္", @"ခ်ီ", @"ခ်ိဳး", @"ေခ်ာင္း", @"ခို", @"ခိုး", @"ခါ", @"ခု", @"ခုန္", @"ခြာ", @"ခ်ဳ", @"ခ်ာ", @"ခံ", @"ခြင့္", @"ခြင့္လႊတ္", @"ခြင့္ေတာင္း", @"ခြင့္ပန္", @"ခြင့္ဆို", @"ခြဲ", @"ခ်ဲ", @"ခန္း", @"ခမ္း", @"ခ်မ္း", @"ခနဲ႔", @"ခၽြဲ", @"ခက္ထန္", @"ေခါက္", @"ေျခာက္", @"ခိုင္း", @"ခန္႔", @"ခပ္", @"ခ်ီးက်ဴး", @"ခ်ီးမြမ္း", @"ခ်ီးေျမႇာက္", @"ေခ်", @"ေခ်ငံ", @"ေခ်ာ႔", @"ေခ်ာ္ေတာေငါ့", @"ခ်ိဳး", @"ေခ်ာက္က်", @"ေခ်ာက္ခ်", @"ေခ်ာက္တြန္း", @"ခ်င့္", @"ခ်ိန္", @"ေခ်ာလဲေရာထိုင္", @"ေခ်ာင္းဆိုး", @"ေခ်ာင္းဟန္႕", @"ခ်ည္", @"ခ်ိတ္", @"ခြင္", @"ခ်ိန္သားကိုက္", @"ခ်ဳန္း", @"ခ်ယ္", @"ခ်မ္းသာ", @"ခ်ံဳး", @"ျခား", @"ေျခ", @"ျခဴ", @"ၿခိဳးျခံ", @"ျခစ္", @"ခြံ႕", @"ခြပ္", @"ခ်န္", @"ႁခြင္း", @"ေခ်ာင္းေျမာင္း", @"ခင္", @"ေခာင္း", @"ခင္း", @"ခုတ္", @"ခူး" };
/*ga ngal*/
#define MYANMAR_VERB_C @[ @"ဂန္႔" ]
/*ga gyi*/
#define MYANMAR_VERB_D @[]
/*nga*/
#define MYANMAR_VERB_E @[ @"ငို", @"ေငး", @"ငမ္း", @"ငိုက္", @"ၿငိမ္း", @"ငူ", @"ငဲ့", @"ေငါ့", @"ေငါက္", @"ငိုက္မ်ဥ္း", @"ငင္", @"ငတ္", @"ငုပ္", @"ငံု", @"ငံု႕", @"ျငာ", @"ျငား", @"ၿငီး", @"ေငြ႕", @"ၿငိဳ", @"ျငင္", @"ၿငိဳး", @"ျငင္း", @"ၿငိမ္", @"ၿငိမ့္", @"ငွား", @"ငဲွ႔", @"ၿငိႇမ္း", @"ၿငိ" ]
/*sa lone*/
#define MYANMAR_VERB_F @[ @"စု", @"စင္", @"စုတ္", @"စိုက္", @"စား", @"စိမ့္", @"စြပ္", @"စီး", @"စစ္", @"ေစ့", @"စူး", @"စယ္", @"ေစာင့္", @"စာနာ", @"စာက်က္", @"စို", @"စိမ္", @"စိပ္", @"စြင့္", @"စီ", @"ေစာင္း", @"စာ", @"စင္", @"စံ", @"စပ္", @"စုပ္", @"စမ္း", @"စိမ့္", @"စံု", @"စြ", @"စြာ", @"ေစြ", @"စြဲ", @"စြမ္း", @"စည္း", @"စြန္႔", @"စို႔", @"စြတ္", @"စိုး", @"ေစာက္", @"စင္း", @"ေစာင္", @"စန္႔", @"စိန္" ]
/*sa lain*/
#define MYANMAR_VERB_G @[ @"ဆု", @"ဆြတ္", @"ဆစ္", @"ဆယ္", @"ဆုတ္", @"ဆင္", @"ဆုိက္", @"ေဆး", @"ဆြဲ", @"ဆံုး", @"ဆန္႔", @"ဆီး", @"ဆပ္", @"ဆို", @"ေဆာင့္", @"ဆင္း", @"ဆူ", @"ဆာ", @"ဆဲ", @"ဆ", @"ေဆာ္", @"ေဆာက္", @"ဆြယ္", @"ဆတ္", @"ေဆာ့", @"ဆံ့", @"ဆို႔", @"ဆက္", @"ဆိုက္", @"ဆင့္", @"ေဆာင္း", @"ဆိုင္", @"ဆည္း", @"ဆိတ္", @"ဆိုင္း", @"ဆန္း", @"ဆုန္း", @"ဆုပ္", @"ဆမ္း", @"ဆိမ့္", @"ဆံု", @"ဆယ္", @"ဆြ", @"ေဆြး", @"ဆြန္႔" ]

/*za zwal*/
#define MYANMAR_VERB_H @[]

/*za myin swal*/
#define MYANMAR_VERB_I @[]

/*nya*/
#define MYANMAR_VERB_J @[ @"ညႇပ္", @"ညႇိ", @"ညာ", @"ညိတ္", @"ညပ္", @"ညႇို႕", @"ေညႇာ္", @"ညံ", @"ေညာင္း", @"ညစ္", @"ညား", @"ညီ", @"ညက္", @"ညူး", @"ညည္း", @"ညြတ္", @"ညြန္႔", @"ညႇာ", @"ညႇိုး", @"ညႇင္း", @"ေညႇာင့္", @"ညႇစ္", @"ညႇဥ္း", @"ၫြွတ္", @"ၫြွန္", @"ၫြွန္း" ]

/*ta ta lin chate*/
#define MYANMAR_VERB_K @[]

/*hta won bal*/
#define MYANMAR_VERB_L @[]

/*da yin kout*/
#define MYANMAR_VERB_M @[]

/*da yin mhote*/
#define MYANMAR_VERB_N @[]

/*na gyi*/
#define MYANMAR_VERB_O @[]

/*ta win pu*/
#define MYANMAR_VERB_P @[ @"တိုက္", @"ေတြ႔", @"တက္", @"တပ္", @"တံုး", @"တင္", @"တစ္", @"တမ္း", @"တ", @"ေတာင္း", @"ေတြး", @"တြဲ", @"တည္", @"တူး", @"တီး", @"ေတာက္", @"တိုင္း", @"တန္း", @"တုန္", @"တန္", @"တြန္း", @"တြက္", @"တိတ္", @"တည္း", @"တည္းျဖတ္", @"တုတ္", @"ေတ", @"တား", @"တိ", @"တု", @"တူ", @"ေတ့", @"ေတာ့", @"ေတာ္", @"ေတာ္လည္း", @"ေတာ္လွန္", @"ေတာ္ဝင္", @"တက္လွမ္း", @"ေတာက္ေခါက္", @"တိုးႀကိတ္", @"တိုးခ်ဲ႕", @"တိုးတက္", @"တိုးပြား", @"တိုးျမႇင့္", @"တိုးလွ်ိဳး", @"တက္", @"တက္ႂကြ", @"တက္ေရာက္", @"တို႔", @"တိုး", @"တိုက္ေကၽြး", @"တိုက္ခိုက္", @"တိုက္စား", @"တိုက္ဆိုင္", @"တိုက္တြန္း", @"တိုက္ဖ်က္", @"တင္ႀကိဳ", @"တင္ကူး", @"တင္စား", @"တင္စီး", @"တင္ဆက္", @"တင္ေဆာင္", @"တင္ေတာင္း", @"တင္ျပ", @"တိုက္ပိတ္", @"တင္ပို႔", @"တင္ေျမႇာက္", @"တင္ေလွ်ာက္", @"တင္သြင္း", @"တင္း", @"တင္းႀကပ္", @"တင္းတိမ္", @"ေတာင္", @"ေတာင္းဆို", @"ေတာင္းပန္", @"တိုင္", @"တိုင္ႀကား", @"တိုင္ေတာ", @"တိုင္တည္", @"တိုင္တန္း", @"တိုင္ပင္", @"တစ္စင္ေထာင္", @"တစ္ပတ္႐ိုက္", @"တစ္ပတ္လွိမ့္", @"တစ္ပန္း႐ႈံး", @"တစ္ပန္းသာ", @"တစ္ေရးႏိုး", @"တည္ၾကည္", @"တည္ခင္း", @"တည္ျငိမ္", @"တည္ေဆာက္", @"တည္တံ့", @"တည္ေထာင္", @"တည္ျမဲ", @"တည္ရာ", @"တည္ရွိ", @"တည့္မတ္", @"တတ္", @"တတ္ကၽြမ္း", @"တတ္စြမ္း", @"တတ္ႏိုင္", @"တတ္ပြန္", @"တတ္ေျမာက္", @"တတ္သိလိမၼာ", @"တန္ကာက်", @"ေတာ္ကာက်", @"တန္ျပန္", @"တန္ဖိုးျဖတ္", @"တန္႔", @"တန္းစီ", @"တန္းညႇိ", @"တန္းျဖုတ္", @"တုန္ခါ", @"တုန္ခ်ည့္", @"တပ္ၿငိ", @"တပ္စြန္း", @"တပ္ဆင္", @"တပ္ႏွစ္သက္", @"တပ္ေႁပြ႕", @"တပ္မက္", @"တပ္ၿမို႕", @"တပ္ေခါက္", @"တပ္ခင္း", @"တပ္ႏုတ္", @"တပ္ပ်က္", @"တပ္ေဖ်ာက္", @"တပ္ျဖန္႔", @"တပ္လန္", @"တပ္လွန္႕", @"တုပ္", @"တုပ္ကြ", @"တုပ္ေႏွာင္", @"တုပ္ပ်ပ္", @"တုပ္ဝပ္", @"တမ္းေစ့", @"တမ္းတ", @"တိမ္", @"တိမ္ေကာ", @"တိမ္ငုပ္", @"တိမ္ျမုပ္", @"တိမ္က်", @"တိမ္ခြပ္", @"တိမ္ေတာက္", @"တိမ္း", @"တိမ္းေစာင္း", @"တိမ္းညြတ္", @"တိမ္းပား", @"တိမ္းမပ္", @"တိမ္းေမွာက္", @"တိမ္းယိမ္း", @"တိမ္းေရွာင္", @"တံု", @"တံု႔", @"တံု႔ကန္", @"တံု႔ဆိုင္း", @"တံု႔ျပန္", @"တံုးေက်ာ္", @"တံုးေခါက္", @"တံုးတံုးခ်", @"တြ", @"တြား", @"ေတြ", @"ေတြေဝ", @"ေတြ႕", @"ေတြ႕ႀကံု", @"ေတြ႕ဆံု", @"ေတြ႕ထိ", @"ေတြ႕ျမင္", @"ေတြးေခၚ", @"ေတြးဆ", @"ေတြးေတာ", @"ေတြးထင္", @"ေတြးေျမာ္", @"ေတြးရွူ", @"တြဲခုတ္", @"တြဲခ်ိတ္", @"တြဲစပ္", @"တြဲထိုး", @"တြဲဖက္", @"တြဲ႕", @"တြက္ကတ္", @"တြက္ေျခကိုက္", @"တြက္ခ်က္", @"တြက္ခ်င့္", @"တြယ္တာ", @"တြက္စစ္", @"တြက္ဆ", @"တြက္သားကိုက္", @"တြင္ခုပ္", @"တြင္စုပ္", @"တြင္ခံ", @"တြင္ခုတ္", @"တြင္းစိမ္", @"တြင္းေအာင္း", @"တြတ္", @"တြယ္", @"တြတ္ထိုး", @"တြန္", @"တြန္က်ဴး", @"တြန္႔", @"တြန္႔ဆုတ္", @"တြန္႔တို", @"တြန္႔ရွံူ႕", @"တြန္႔လိမ္", @"တြန္႔လိပ္", @"တြန္းကန္", @"တြန္းထိုး", @"တြန္းလွန္", @"တြန္းအားေပး", @"တြပ္" ]

/*hta sin htoo*/
#define MYANMAR_VERB_Q @[ @"ထ", @"ထား", @"ထုတ္", @"ထု", @"ထြက္", @"ထိုး", @"ထည့္", @"ထိုင္", @"ထိန္း", @"ထင္", @"ထြန္း", @"ထိုက္", @"ထန္" ]

/*da dway*/
#define MYANMAR_VERB_R @[]

/*da ote chite*/
#define MYANMAR_VERB_S @[]

/*na*/
#define MYANMAR_VERB_T @[ @"နိုး", @"ေန", @"နာ", @"နမ္း", @"နွိပ္", @"နင္း", @"နယ္", @"နား", @"နာႀကည္း", @"ေႏွာင့္ယွက္", @"နပ္", @"ႏွိမ္", @"ႏွိး" ]

/*pa sout*/
#define MYANMAR_VERB_U @[ @"ေပါက္", @"ေပး", @"ျပစ္", @"ေျပာ", @"ျပဳတ္", @"ပုန္း", @"ေပြ႔", @"ပန္း", @"ေျပး", @"ျပံုး", @"ပင္ပန္း", @"ေပ်ာက္", @"ၿပဳ", @"ျပင္", @"ပူေဇာ္", @"ပါ", @"ေပါင္း", @"ပသ", @"ပက္", @"ပတ္", @"ျပ", @"ပန္", @"ျပည့္", @"ပုတ္", @"ပြ", @"ပြတ္", @"ပူး", @"ျပဲ", @"ၿပီး", @"ပိတ္", @"ပိုး" ]

/*pha ote htoke*/
#define MYANMAR_VERB_V @[ @"ျဖတ္", @"ျဖဲ", @"ဖြတ္", @"ဖြား", @"ဖက္", @"ေဖ်ာ္", @"ျဖုတ္", @"ဖမ္း", @"ေျဖ", @"ေဖာ", @"ျဖစ္", @"ေျဖာင့္", @"ဖြင့္", @"ဖုတ္", @"ေဖြ", @"ဖ်က္", @"ဖူး" ]

/*ba la chite*/
#define MYANMAR_VERB_W @[]

/*ba kone*/
#define MYANMAR_VERB_X @[ @"ဘုန္း", @"ဘန္း" ]

/*ma*/
#define MYANMAR_VERB_Y @[ @"မ", @"မွန္း", @"ေမြး", @"ျမင္", @"ေမး", @"ျမန္း", @"မုန္း", @"ေမႊး", @"မိ", @"မွီ", @"ေမွ်ာ္", @"ေမာ", @"မူး", @"ေမ်ာ", @"ေျမာက္", @"မြန္း", @"မွတ္", @"ေမ့", @"မုန္း", @"မႈတ္", @"မက္", @"မွိတ္", @"မြ", @"ေမွာက္", @"မႈန္း", @"ျမႇူ", @"ေျမႇာ္" ]

/*ya pa let*/
#define MYANMAR_VERB_Z @[ @"ယူ", @"ယက္", @"ယို", @"ယား", @"ယံု", @"ေယာင္" ]

/*ya kout*/
#define MYANMAR_VERB_AA @[ @"ရွိ", @"ရိ", @"ရ", @"ရီ", @"ရွင္", @"ရွင္သန္", @"ရွင္း", @"ရွုံ", @"ရိုက္", @"ရစ္", @"ရူး", @"ရွိခိုး", @"ရွုံး", @"ေရး", @"ရြတ္", @"ေရွာက္", @"ရွက္", @"ရြာ", @"ေ႐ႊ႕", @"ရွာ", @"ရင့္", @"ေရာက္" ]

/*la*/
#define MYANMAR_VERB_BB @[ @"လိုက္", @"လာ", @"လုပ္", @"ေလွ်ာ္", @"လန္", @"ေလွာ္", @"လည္", @"လို", @"လြင့္", @"ေလွ်ာက္", @"လႊား", @"လင့္", @"လႊတ္", @"လြတ္", @"လဲ", @"လိမ္", @"လိန္", @"လန္႔", @"ေလွ်ာ့", @"ေလွ်ာ", @"လွန္", @"လံုး", @"လြန္", @"ေလာင္", @"လီ", @"လန္႔", @"လံႈ", @"လင္း" ]

/*wa*/
#define MYANMAR_VERB_CC @[ @"ဝ", @"ဝတ္", @"ဝယ္", @"ေဝး", @"ဝဲ", @"ဝါး", @"ဝိုင္း", @"ေဝ" ]

/*tha*/
#define MYANMAR_VERB_DD @[ @"သ", @"သြား", @"ေသ", @"သုပ္", @"သုတ္", @"သန္႔", @"သစ္", @"ေသာက္", @"သယ္", @"ေသြး", @"သတ္", @"သိ", @"သင္း", @"သီး", @"သမ္း", @"သီ" ]

/*ha*/
#define MYANMAR_VERB_EE @[ @"ဟ", @"ဟုတ္", @"ဟန္ေဆာင္" ]

/*la gyi*/
#define MYANMAR_VERB_FF @[]

/*a*/
#define MYANMAR_VERB_GG @[ @"အ", @"အိပ္", @"ေအာင္", @"အုပ္", @"ေအာင့္", @"ေအာင္း" ]

#pragma mark - Myanmar Adj Adv

#define MYANMAR_ADJADV_A @[ @"ကိုက္", @"ေကာင္း", @"ႀကီး", @"က်ဲ", @"က်စ္", @"က်ိဳင္း", @"က်ိတ္", "ႂကြယ္", @"က်ယ္", @"က်ဥ္း", @"က်ဥ္", @"ႀကပ္", @"ႀကိဳင္", @"ကြ", "ႂကြပ္", @"ကန္႔", @"က်ိ", @"ေႀကာင္", @"ကၽြတ္", @"ၾကတ္", @"ေကာက္", @"ႀကည္", @"ေကြး", @"ကြက္", @"က်ား", @"ကြင္း", @"ကန္႔လန္႔", @"ကုန္ကုန္", @"ကလိန္", @"ကလိန္", @"ႀကိဳတင္", @"ၾကည္လင္", @"က်ဥ္းက်ုတ္", @"က်ဥ္းေျမာင္း", @"ကၽြက္ကၽြက္", @"ၾကံ့ၾကံ့ခံ", @"ကျမင္းေၾကာ", @"ကေပါက္တိ", @"ကေပါက္ခ်ာ", @"ကစိုကရြား", @"ကတုန္းကတိုက္", @"ကစဥ္ကလ်ား", @"ကပက္ကစက္", @"ကစိန္းကဝား", @"ကေပါက္ကေရာက္", @"ကတုန္ကယင္", @"က်ဴက်ဴပါေအာင္", @"ကပိုက႐ို", @"ကၿပက္ကေခ်ာ္", @"ကႏြဲ႕ကလ်", @"ကိုယ္ထူးကိုယ္ခ်ြန္", @"ကပ်ာကယာ", @"ကေမာက္ကမ", @"ကပ်စ္ကညစ္", @"ကေရာေသာပါး", @"ကမကထ", @"ကေရာကမယ္", @"ကမန္းကတန္း", @"ကေလကလြင့္", @"ကရိကထ", @"ကလန္ကလား", @"ကလီကမာ", @"ကလိန္းကလက္", @"ကူလီကူမာ", @"ကေသာကေမ်ာ", @"ကလန္ကဆန္", @"ကတ္တီးကတ္ဖဲ့", @"ကသီကရီ", @"ကန္႔လန္႔ကန္႔လန္႔", @"ကသီလင္တ", @"က်ိဳးတိုးက်ဲတဲ", @"ကမူးရွူးထိုး", @"ကတုန္ကရင္", @"ကပ်ာကသီ", @"ႀကံႀကီးစည္ရာ", @"ကေတာကေမ်ာ", @"ႀကိဳးႀကားႀကိဳးႀကား", @"ကေတာက္ကဆတ္", @"ၾကက္ပ်ံမက်", @"ကေတာက္ကတက္", @"ႀကက္ေပ်ာက္ငွက္ေပ်ာက္", @"ကေလးကလား", @"ကတိုက္ကရိုက္", @"ကေျပာင္းကျပန္", @"ကလိန္ကက်စ္", @"ကယုကယ", @"ကေယာင္ေခ်ာက္ခ်ား", @"ကေယာက္ကယက္", @"ကတမ္းကရမ္း", @"ကေယာင္ကတမ္း", @"ကေမ်ာေသာပါး", @"ေၾကာက္ေၾကာက္ရြံ႕ရြံ႕", @"ကုတ္ကုတ္ကတ္ကတ္", @"ကလယ္ကလယ္", @"ကတ္ကတ္သတ္သတ္", @"ကသိကေအာက္", @"ကတ္သီးကတ္သတ္", @"ကိုးရိုးကားယား", @"ကိုယ္ထိလက္ေရာက္", @"ကိုးလိုးကန္႔လန္႔", @"က်ီးကန္းေတာင္ေမွာက္", @"ႀကိဳးစားပမ္းစား", @"ေက်ေက်လည္လည္", @"ၾကက္အိပ္ၾကက္ႏိုး", @"ႀကိဳးႀကိဳးကုတ္ကုတ္" ]

/*kha khay*/
#define MYANMAR_ADJADV_B @[ @"ခဲ", @"ခ်ာ", @"ခ်မ္း", @"ေျခာက္", @"ခ်ိ", @"ေခ်ာ", @"ေျခာက္", @"ခ်ဥ္", @"ခ်ို", @"ခား", @"ခိုင္", @"ခန္႔", @"ခက္", @"ေခါင္", @"ခိုက္", @"ခၽြဲ", @"ခ်ဲ႕ခ်ဲ႕", @"ခ်ိဳ႕ယြင္း", @"ခိုင္မာ", @"ခ်ိဳ႕တဲ့", @"ခ်ိဳ႕ငဲ့", @"ခက္ခဲ", @"ခမ္းနား", @"ေခ်ာေမာ", @"ေခ်ာေမြ႕", @"ခ်က္ခ်င္း", @"ခ်က္ခနဲ", @"ခ်စ္စႏိုး", @"ခ်ာခနဲ", @"ခ်စ္ခ်စ္ေတာက္", @"ခ်ာခ်ာလည္", @"ခ်မ္းစိမ့္စိမ့္", @"ခ်ာတူးလန္", @"ခပ္တန္းတန္း", @"ေခ်ာက်ိက်ိ", @"ခ်က္တစ္ျဖုတ္", @"ခ်ိဳျမျမ", @"ခ်င့္စဖြယ္", @"ခံုတမင္", @"ခ်င္စဖြယ္", @"ခေနာ္နီ", @"ခေနာ္နဲ႔", @"ခိုးလိုးခုလု", @"ခ်က္ေစ့လက္ေစ့", @"ခမ္းႀကီးနားႀကီး", @"ခေနာ္ခနဲ႔", @"ခမ္းခမ္းနားနား", @"ခ်ာလပတ္လည္", @"ခ်ိဳးခ်ိဳးဖဲ့ဖဲ့", @"ေခ်ာေခ်ာေမာေမာ", @"ခ်က္က်လက္က်", @"ေခ်ာက္ခ်ီးေခ်ာက္ခ်က္", @"ခ်က္ခ်င္းလက္ငင္း", @"ေခ်ာက္တီးေခ်ာက္ကပ္", @"ခ်မ္းခ်မ္းသာသာ" ]

/*ga ngal*/
#define MYANMAR_ADJADV_C @[]

/*ga gyi*/
#define MYANMAR_ADJADV_D @[]

/*nga*/
#define MYANMAR_ADJADV_E @[ @"ငိုက္", @"ငံ", @"ငန္", @"ငယ္ရြယ္", @"ေငြ႕ေငြ႕", @"ငမ္းငမ္းတက္", @"ငိုးတိုးေငါက္ေတာက္", @"ငယ္စဥ္ႀကီးလိုက္", @"ျငိဳးျငိဳးျငိမ့္ျငိမ့္", @"ငြားငြားစြင့္စြင့္" ]

/*sa lone*/
#define MYANMAR_ADJADV_F @[ @"စို", @"စပ္", @"စိပ္", @"စိမ္း", @"ေစး", @"စည္", @"ေစာ", @"ေစြ႕ေစြ႕", @"ေစြးေစြး", @"စစ္စစ္", @"စိတ္ႀကိဳက္", @"ေစာေစာ", @"စီရရီ", @"စိတ္ရွိတိုင္း", @"ေစြ႕ခနဲ", @"စိမ္းဆတ္ဆတ္", @"စုတ္ခ်ြန္းခ်ြန္း", @"စိမ္းဖပ္ဖပ္", @"စင္းလံုးေခ်ာ", @"စိမ္းဖန္႔ဖန္႔", @"စိမ္းေရႊေရႊ", @"စန္႔စန္႔ရန္႔ရန္႔", @"စြပ္စြပ္ရြပ္ရြပ္", @"စိတ္ေအးလက္ေအး", @"စိတ္လိုလက္ရ", @"ေစာေစာစီးစီး", @"စိတ္ခ်လက္ခ်", @"စစ္စစ္ေပာက္ေပာက္", @"စိတ္ေနာက္ကိုယ္ပာ", @"စဥ္းစဥ္းစားစား", @"စြမ္းစြမ္းတမံ", @"ေစာ္ကားေမာ္ကား", @"စိတ္ေထာင္းကိုယ္ေႀက", @"ေစာင္းပားရိပ္ခ်ည္", @"စိတ္ပာလက္ပာ", @"စည္းမဲ့ကမ္းမဲ့", @"စြတ္ကယ္စြတ္ကယ္", @"စည္းလြတ္ဝားလြတ္", @"စြတ္စြတ္ရြတ္ရြတ္", @"စိတ္တူကိုယ္မွ်" ]

/*sa lain*/
#define MYANMAR_ADJADV_G @[ @"ဆူ", @"ဆိုး", @"ဆိမ့္", @"ဆြဆြ", @"ဆိုးသြမ္း", @"ဆက္တိုက္", @"ဆက္လက္", @"ဆတ္ဆတ္", @"ဆက္ဆက္", @"ေဆာလ်င္", @"ဆိုးရြား", @"ဆိုးဝါး", @"မေရြး", @"မရ", @"ဆတ္ခနဲ", @"ေဆာတလ်င္", @"ဆိုးခနဲ", @"ေဆာက္တည္ရာ", @"ဗံုမဆင့္", @"ဆိုင္းမဆင့္", @"ဆူးဆူးရားရား", @"ဆင္းေတာင့္ဆင္းရဲ", @"ဆူႀကံဳနိမ့္ျမင့္", @"ေဆာင့္ႀကီးေအာင့္ႀကီး", @"ဆတ္ေကာ့လတ္ေကာ့", @"ဆင္းဆင္းရဲရဲ", @"ဆတ္တငံ့ငံ့", @"ဆြဲဆြဲငင္ငင္", @"ဆိုးဆိုးဆတ္ဆတ္", @"ဆယ္ခါတစ္ခါ", @"ေဆးေဖာေႀကာဖက္", @"ဆန္႔ငင္ဆန္႔ငင္" ]

/*za zwal*/
#define MYANMAR_ADJADV_H @[ @"ဇြတ္", @"ဇက္ကုန္", @"ေဇာက္ခ်", @"ဇိုးခနဲ", @"ဇတ္ခနဲ", @"ဇြတ္တရြတ္", @"ဇက္ရဲလက္ရဲ", @"ဇိုးဇိုးဇတ္ဇတ္", @"ဇြတ္တိဇြတ္ထိုး", @"ေဇာက္တိေဇာက္ထိုး", @"ေဇာက္ထိုးမိုးေမွ်ာ္" ]

/*za myin swal*/
#define MYANMAR_ADJADV_I @[]

/*nya*/
#define MYANMAR_ADJADV_J @[ @"ညံ", @"ညံ့", @"ညက္", @"ညို", @"ညို႕", @"ညႇက္", @"ညင္း", @"ညႇဥ္းဆိုးဆိုး", @"ညႇဥ္းသိုးသိုး", @"ညလံုးေပာက္", @"ေညာင္ညည့္ညည့္", @"ေညာင္နာနာ", @"ညီညီညာညာ", @"ညိုးညိုးညံညံ", @"ညီညာျဖျဖ", @"ညိုးညိုးညိတ္ညိတ္", @"ညီတူညာတူ", @"ညစ္တီးညစ္ပတ္", @"ညစ္ညစ္ပတ္ပတ္" ]

/*ta ta lin chate*/
#define MYANMAR_ADJADV_K @[]

/*hta won bal*/
#define MYANMAR_ADJADV_L @[]

/*da yin kout*/
#define MYANMAR_ADJADV_M @[]

/*ဎ*/
#define MYANMAR_ADJADV_N @[]

/*na gyi*/
#define MYANMAR_ADJADV_O @[]

/*ta win pu*/
#define MYANMAR_ADJADV_P @[ @"ေတာ္", @"ေတာင္", @"တင္း", @"ေတာက္", @"တင့္", @"တည္း", @"တို", @"တုတ္", @"တယ္", @"တမင္", @"ေတာ္ေတာ္", @"တင္းလင္း", @"တန္းလန္း", @"တင္းရင္း", @"ေတာ္တည့္", @"တက္သုတ္", @"တက္တက္", @"တင္းတင္း", @"တင္းမာ", @"တစ္ပါး", @"တြတ္တြတ္", @"တေစ", @"တေစာင္း", @"တကြ", @"တျခား", @"တံ့တံ့", @"တံုးတိ", @"တမာ", @"တလြဲ", @"တဝ", @"တိုးလွ်ိဳ", @"တိုေတာင္း", @"တစ္ခါ", @"တစ္ဆင့္", @"တစ္ႏိုင္", @"တတ္တိုင္း", @"တံုးေတ", @"ေတြေတြ", @"တူးတည္", @"တကယ္", @"တကယ့္", @"တိုထြာ", @"ေတာက္ေျပာင္", @"တပ္အပ္", @"တပ္ၾကပ္", @"တစ္အား", @"တံုးလံုး", @"တြဲလဲ", @"တြဲေလာင္း", @"တြဲလ်ား", @"တရေဟာ", @"တရရ", @"တရားေသ", @"တက္သစ္စ", @"တရိရိ", @"တစ္ျပိုင္နက္", @"တရုန္းရုန္း", @"တစ္ျပန္စီး", @"တရိပ္ရိပ္", @"တစ္ျပံဳႀကီး", @"တလန္းႀကား", @"တျဖဳတ္ျဖဳတ္", @"တသုန္သုန္", @"တမ်ားမ်ား", @"တသြင္သြင္", @"တျမျမ", @"တာေတလံ", @"တရႀကမ္း", @"တရႏွံ႔", @"တရစပ္", @"တဟုန္းဟုန္း", @"တရတြန္း", @"တအိအိ", @"တစ္ပါတည္း", @"တစ္ပင္တိုင္", @"တစူးစား", @"တစ္ပတ္ႏြမ္း", @"တေထာင္းေထာင္း", @"တစ္ပတ္ရစ္", @"တထစ္ခ်", @"တေလွာင္းေလွာင္း", @"တစ္ဟုန္ထိုး", @"တစ္ကိုယ္ေကာင္း", @"တစ္ဖက္သတ္", @"တစ္က်ံ႕တည္း", @"တစ္ျဖတ္တည္း", @"တစ္ခ်က္တည္း", @"တခိခိ", @"တစ္ခ်က္လြွတ္", @"တခစ္ခစ္", @"တႏံု႔ႏံု႔", @"တေငြ႕ေငြ႕", @"တဖြဖြ", @"တစီစီ", @"တျဖဴးျဖဴး", @"တံုးတိတိ", @"တအီအီ", @"တစ္ခါက", @"တက်က္က်က္", @"တတြတ္တြတ္", @"တက်ည္က်ည္", @"တျဖည္းျဖည္း", @"တစာစာ", @"တဖ်ဥ္းဖ်ဥ္း", @"တသြတ္သြတ္", @"တေရွာင္ေရွာင္", @"တိုနံ႔နံ႔", @"တလွပ္လွပ္", @"တက္တက္စင္", @"တသက္သက္", @"တစ္ခါတည္း", @"တစ္ေနကုန္", @"တစ္ဇြတ္ထိုး", @"တစ္ေျပးညီ", @"တကဲကဲ", @"တစ္ေျပးတည္း", @"တေကာက္ေကာက္", @"တစ္ရွဴးထိုး", @"တစိမ့္စိမ့္", @"တစ္ရွိန္ထိုး", @"တစြတ္စြတ္", @"တစ္သားတည္း", @"တိတ္တခိုး", @"တစ္ဆက္တည္း", @"တိတ္တဆိတ္", @"တစ္ထပ္တည္း", @"တစ္ဘီးလွိမ့္", @"တိတ္တိတ္ပုန္း", @"တစ္သီႀကီး", @"တစ္ေလာက", @"တစ္ျမံဳတစ္မ", @"တဖ်င့္တပါး", @"တိတိပပ", @"တစီတလ်ဥ္", @"တေစ့တေစာင္း", @"တစီးတေစာင္း", @"တပိတပိုင္း", @"တဝဲလည္လည္", @"တပိုတပါး", @"တိတိရိရိ", @"တလံုလဲလဲ", @"တိတိလင္းလင္း", @"ေတာ္ရံုတန္ရံု", @"တံခါးမရွိ", @"ေတာ္ရိေလ်ာ္ရိ", @"တီတီတာတာ", @"တသီတသန္း", @"တိုစိတိုစိ", @"တိုးလိုးတန္းလန္း", @"တစ္စတစ္စ", @"တိုးလိုးတြဲေလာင္း", @"တစ္ဖက္စီးနင္း", @"တစ္လက္စတည္း", @"တစ္လံုးတစ္ခဲ", @"တစ္ဝက္တစ္ပ်က္", @"တတန္တက", @"တစ္သမတ္တည္း", @"တေထဝတည္း", @"ေတာ္စြေလ်ာ္စြ", @"တအံုေႏြးေႏြး", @"တိုေရရွားေရ", @"တစ္ခါတေလ", @"တစ္တိတစ္တိ", @"တစ္ခာတစ္ရံ", @"တကူးတက", @"တေတာက္ပတ္ပတ္", @"တကူးတကန္႔", @"တေထရာတည္း", @"ေတာ္ေတာ္တန္တန္", @"တဖ်စ္ေတာက္ေတာက္", @"တိုးတိုးက်ိတ္က်ိတ္", @"တရားလက္လြတ္", @"တိုးတိုးတိတ္တိတ္", @"တရြတ္တသီ", @"တက္ကုန္လက္ကုန္", @"တလိမ့္ေခါက္ေကြး", @"တက္ညီလက္ညီ", @"တိုတိုေတာင္းေတာင္း", @"တင္းျပည့္က်ပ္ျပည့္", @"တိုတိုတုတ္တုတ္", @"တင့္ေတာင့္တင့္တယ္", @"တိုးတိုးသက္သာ", @"တင္းတင္းရင္းရင္း", @"တူတူတန္တန္", @"တစ္ေန႔တျခား", @"ေတာ့တီးေတာ့တ", @"တစ္ပံုစံတည္း", @"ေတာ္ကာေလ်ာ္ကာ", @"တစ္ဖက္ေစာင္းနင္း", @"တစ္ႏိုင္တစ္ပိုင္", @"တစ္ရံတစ္ဆစ္", @"တစ္ျမံုတစ္သိုက္", @"တံု႔ေႏွးတံု႔ေႏွး", @"တစ္ေန႔တစ္ျခား", @"တံု႔ပယ္တံု႔ပယ္", @"တစ္မုဟုတ္ခ်င္း", @"တန္းတူရည္တူ", @"တန္းတန္းမတ္မတ္", @"တံုးလံုးပက္လက္", @"တစ္ဖက္တစ္လမ္း", @"တုန္တုန္ယင္ယင္", @"တည္တည္ပပ", @"တုန္တုန္ရီရီ", @"တြန္းတြန္းထိုးထိုး", @"တပ္အပ္ေသခ်ာ", @"တစ္ေယာက္တစ္ေပာက္", @"တစ္ေအာင့္တစ္နား", @"တစ္ေယာက္တစ္ျပန္", @"တည္တည္ၾကည္ၾကည္", @"တစ္ေယာက္တစ္လဲ", @"တစ္ေယာက္တစ္လွည့္" ]

/*hta sin htoo*/
#define MYANMAR_ADJADV_Q @[ @"ထိုင္း", @"ထူး", @"ထံု", @"ထက္", @"ထြား", @"ေထာ္", @"ထတ္", @"ထန္႔", @"ထိန္", @"ထြက္", @"ထူးျခား", @"ထက္ျမက္", @"ထီးတည္း", @"ထူးေထြ", @"ေထာ့က်ိုး", @"ေထာ့နဲ႔", @"ေထာ့နင္း", @"ထက္ခ်ည္း", @"ထက္ခ်မ္း", @"ထက္ပိုင္း", @"ေထာင့္တန္း", @"ထစ္ထစ္", @"ထပ္ဆင့္", @"ထပ္ကြမ္း", @"ထပ္တူ", @"ထပ္မံ", @"ထပ္ေလာင္း", @"ထိပ္တိုက္", @"ထြားက်ိဳင္း", @"ေထြလာ", @"ထြက္ျမတ္", @"ထာဝစဥ္", @"ထီးထီးႀကီး", @"ထစ္ခနဲ", @"ထိတ္ထိတ္ႀကဲ", @"ထုတ္ခ်င္းေပါက္", @"ထပ္မနား", @"ထံုေတေတ", @"ထံုေပေပ", @"ထီးထီးမားမား", @"ေထာ္ေလာ္ကန္႔လန္႔", @"ထိုးထိုးေထာင္ေထာင္", @"ထက္ႀကပ္မကြာ", @"ထိုက္ထိုက္တန္တန္", @"ထင္ေယာင္ထင္မွား", @"ထင္ရာျမင္ရာ", @"ေထာင္ေထာင္ေမာင္းေမာင္း", @"ေထာင္ပံုရာပံု", @"ထည္ထည္ဝါဝါ", @"ထပ္ကာထပ္ကာ", @"ထပ္တူထပ္မွ်", @"ထံု႔ပိုင္းထံု႔ပိုင္း", @"ထပ္တလဲလဲ", @"ထံုးမီစံမွ်", @"ေထြေထြထူးထူး", @"ေထြေထြရာရာ", @"ေထြေထြလည္လည္", @"ေထြးလားလံုးလား", @"ေထြလီကာလီ", @"ေထြးေရာယွက္တင္", @"ေထြးလံုးရစ္ပတ္", @"ထြန္းထြန္းေပါက္ေပါက္" ]

/*da dway*/
#define MYANMAR_ADJADV_R @[]

/*da ote chite*/
#define MYANMAR_ADJADV_S @[]

/*na ngal*/
#define MYANMAR_ADJADV_T @[]

/*pa sout*/
#define MYANMAR_ADJADV_U @[]

/*pha ote htokoe*/
#define MYANMAR_ADJADV_V @[]

/*ba la chite*/
#define MYANMAR_ADJADV_W @[]

/*ba kone*/
#define MYANMAR_ADJADV_X @[]

/*ma*/
#define MYANMAR_ADJADV_Y @[]

/*ya pa let*/
#define MYANMAR_ADJADV_Z @[]

/*ya kout*/
#define MYANMAR_ADJADV_AA @[]

/*la*/
#define MYANMAR_ADJADV_BB @[]

/*wa*/
#define MYANMAR_ADJADV_CC @[]

/*tha*/
#define MYANMAR_ADJADV_DD @[]

/*ha*/
#define MYANMAR_ADJADV_EE @[]

/*la gyi*/
#define MYANMAR_ADJADV_FF @[]

/*a*/
#define MYANMAR_ADJADV_GG @[]

@implementation ZawgyiSegmentationHelper

+ (NSArray *)convertZawgyiSentence:(NSString *)inputStr {
    
    int count = inputStr.length;
    
    NSMutableArray *keeptemporyword = [NSMutableArray array];

    for (NSInteger idx = 0; idx < inputStr.length; idx++) {
        [keeptemporyword addObject:[NSString stringWithFormat:@"%C", [inputStr characterAtIndex:idx]]];
    }
    
    Boolean booleancheck = true;
    int check10, check20, check11, check12 = 0;
    NSString *stringtesting = @"";
    NSString *stringall = @"";
    NSString *stringforarray = @"";
    NSString *stringfinal = @"";
    NSMutableArray *collectionofwords = [NSMutableArray array];
    
    Boolean secondround = false;
    Boolean booleanforfirstround = false;
    Boolean booleanforsecoundround = false;
    Boolean checkwhetherthereisspace = false;
    
    for (int testingcount = 0; testingcount < count; testingcount++)
    {
        
        for (int testingcount1 = 0; testingcount1 < STARTING_WORD.count; testingcount1++)
        {
            
            if ([keeptemporyword[testingcount] isEqualToString:STARTING_WORD[testingcount1]] && booleancheck == false)
            {
                @try {
                    if ([keeptemporyword[testingcount + 1] isEqualToString:@"ၭ"] || [keeptemporyword[testingcount + 1] isEqualToString:@"ၬ"] || [keeptemporyword[testingcount + 1] isEqualToString:@"ၥ"] || [keeptemporyword[testingcount + 1] isEqualToString:@"ၠ"] || [keeptemporyword[testingcount + 1] isEqualToString:@"ၸ"]|| [keeptemporyword[testingcount + 1] isEqualToString:@"ၼ"] || [keeptemporyword[testingcount + 1] isEqualToString:@"႖"] || [keeptemporyword[testingcount + 1] isEqualToString:@"ၱ"] || [keeptemporyword[testingcount + 1] isEqualToString:@"ၲ"] || [keeptemporyword[testingcount + 1] isEqualToString:@"ၦ"] || [keeptemporyword[testingcount + 1] isEqualToString:@"ၧ"] || [keeptemporyword[testingcount + 1] isEqualToString:@"ၺ"] || [keeptemporyword[testingcount + 1] isEqualToString:@"ၵ"] || [keeptemporyword[testingcount + 1] isEqualToString:@"ၶ"] || [keeptemporyword[testingcount + 1] isEqualToString:@"ၻ"] || [keeptemporyword[testingcount + 1] isEqualToString:@"ႅ"] || [keeptemporyword[testingcount + 1] isEqualToString:@"ၡ"] || [keeptemporyword[testingcount + 1] isEqualToString:@"ၣ"] || [keeptemporyword[testingcount + 1] isEqualToString:@"ၳ"] || [keeptemporyword[testingcount + 1] isEqualToString:@"ၴ"] || [keeptemporyword[testingcount + 1] isEqualToString:@"ၹ"] || [keeptemporyword[testingcount + 1] isEqualToString:@"ၨ"])
                    {
                        
                    }
                    else if (keeptemporyword[testingcount + 1] == @"္" || keeptemporyword[testingcount + 1] == @"ၤ")
                    {
                        
                        @try {
                            if (keeptemporyword[testingcount + 2] == @"်" && keeptemporyword[testingcount + 3] == @"ာ" && keeptemporyword[testingcount + 4] == @"း")
                            {
                                /*this will catch the word "yout kyar"*/
                            }
                            else if (keeptemporyword[testingcount + 1 + 1] == @"း" || keeptemporyword[testingcount + 1 + 1] == @"႔" || keeptemporyword[testingcount + 1 + 1] == @"႕" || keeptemporyword[testingcount + 1 + 1] == @"့")
                            {
                                check20 = testingcount + 2;
                                for (int checking = check10; checking <= check20; checking++)
                                {
                                    stringtesting = [NSString stringWithFormat:@"%@%@", stringtesting, keeptemporyword[checking]];
                                }
                                
                                stringall = [NSString stringWithFormat:@"%@%@%@", stringall, stringtesting, @"/"];
                                
                                
                                booleancheck = true;
                                stringtesting = @"";
                                testingcount = testingcount + 2;
                            }
                            else
                            {
                                
                                check20 = testingcount + 1;
                                for (int checking = check10; checking <= check20; checking++)
                                {
                                    stringtesting = [NSString stringWithFormat:@"%@%@", stringtesting, keeptemporyword[checking]];
                                }
                                
                                stringall = [NSString stringWithFormat:@"%@%@%@", stringall, stringtesting, @"/"];
                                
                                booleancheck = true;
                                stringtesting = @"";
                                testingcount++;
                            }
                        } @catch (NSException *exception) {
                            
                            check20 = testingcount + 1;
                            for (int checking = check10; checking <= check20; checking++)
                            {
                                stringtesting = [NSString stringWithFormat:@"%@%@", stringtesting, keeptemporyword[checking]];
                            }
                            
                            
                            stringall = [NSString stringWithFormat:@"%@%@%@", stringall, stringtesting, @"/"];
                            
                            booleancheck = true;
                            stringtesting = @"";
                            testingcount++;
                        }

                        
                    }  //if (keeptemporyword[testingcount+1] == "္")
                    
                    else
                    {   //this will catch plain word..let say ka kyi..kha khway...without "a thet"...like "ka thet in "yout" kyar"...
                        
                        check20 = testingcount;
                        for (int checking = check10; checking < check20; checking++)
                        {
                            stringtesting = [NSString stringWithFormat:@"%@%@", stringtesting, keeptemporyword[checking]];
                        }
                        
                        stringall = [NSString stringWithFormat:@"%@%@%@", stringall, stringtesting, @"/"];
                        
                        booleancheck = true;
                        //  check10 = 0;// check20 = 0;
                        stringtesting = @"";
                        
                    }
                } @catch (NSException *exception) {
                    //consider to use space seperator all the way above.
                    check20 = keeptemporyword.count;
                    for (int item = check10; item < check20; item++)
                    {
                        stringtesting = [NSString stringWithFormat:@"%@%@", stringtesting, keeptemporyword[item]];
                    }
                    
                    stringall = [NSString stringWithFormat:@"%@%@", stringtesting, @"/"];
                } @finally {
                    
                }
                
                
                
            }
            
            
            if (keeptemporyword[testingcount] == STARTING_WORD[testingcount1] && booleancheck == true)
            {
                
                if ([keeptemporyword[testingcount] isEqualToString:@"ေ"] || [keeptemporyword[testingcount] isEqualToString:@"ႀ"] || [keeptemporyword[testingcount] isEqualToString:@"ၿ"] || [keeptemporyword[testingcount] isEqualToString:@"ၾ"] || [keeptemporyword[testingcount] isEqualToString:@"ျ"] || [keeptemporyword[testingcount] isEqualToString:@"ႂ"] || [keeptemporyword[testingcount] isEqualToString:@"ႁ"] || [keeptemporyword[testingcount] isEqualToString:@"ႄ"] || [keeptemporyword[testingcount] isEqualToString:@"ႃ"])
                {
                    if ([keeptemporyword[testingcount] isEqualToString:@"ေ"])
                    {
                        if (keeptemporyword[testingcount + 1] == "ႀ" || keeptemporyword[testingcount + 1] == "ၿ" || keeptemporyword[testingcount + 1] == "ၾ" || keeptemporyword[testingcount + 1] == "ျ" || keeptemporyword[testingcount] == "ႂ" || keeptemporyword[testingcount] == "ႁ" || keeptemporyword[testingcount] == "ႄ" || keeptemporyword[testingcount] == "ႃ")
                        {
                            booleancheck = false;
                            check10 = testingcount;
                            testingcount=testingcount+2;
                        }
                        else
                        {
                            booleancheck = false;
                            check10 = testingcount;
                            
                            testingcount++;
                        }
                    }
                    else
                    {
                        booleancheck = false;
                        check10 = testingcount;
                        testingcount++;
                    }
                    
                    
                }
                else
                {
                    
                    booleancheck = false;
                    check10 = testingcount;
                    
                    
                }
            }
            
            
        }
        
        textBox2.Text += check10 + "//";
        textBox2.Text += check20+"\\";
        
        
        
    }
    
    
    
    return nil;
}


@end
